GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
uint8_t				crash_counter = 0;

uint8_t				CTRL_REG1_value			= 0x10;
uint8_t				PL_BF_ZCOMP_REG_value	= 0xc7;
uint8_t				PL_P_L_THS_REG_vlaue	= 0xcf;


/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static uint8_t mma8451_config( uint16_t param1, uint16_t param2 )
{
	unsigned char res, value;

//standby
	printf( "\r\n%d>mma8451_config", SysTicks );
	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value & ~ACTIVE_MASK ) ) )
	{
		goto lbl_mma8451_config_err;
	}


/*
   res = IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, CTRL_REG1_value);
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
 */
	if( IIC_RegWrite( MMA845X_ADDR, XYZ_DATA_CFG_REG, FULL_SCALE_4G ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*Step 2: Set the data rate to 50 Hz (for example, but can choose any sample rate).
	   CTRL_REG1_Data = IIC_RegRead(0x2A); //Note: Can combine this step with above
	   CTRL_REG1_Data& = 0xC7; //Clear the sample rate bits
	   CTRL_REG1_Data | = 0x20; //Set the sample rate bits to 50 Hz
	   IC_RegWrite(0x2A, CTRL_REG1_Data); //Write updated value into the register.
	 */


/*
   res = IIC_RegRead( MMA845X_ADDR, CTRL_REG1, &value );
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
   value	&= 0xC7;
   value	|= 0x20;
   res		= IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, value );
   if( res )
   {
   goto lbl_mma8451_config_err;
   }
 */


	/*
	   Step 3: Set the PL_EN bit in Register 0x11 PL_CFG. This will enable the orientation detection.
	   PLCFG_Data = IIC_RegRead (0x11);
	   PLCFG_Data | = 0x40;
	   IIC_RegWrite(0x11, PLCFG_Data);
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_CFG_REG, 0xc0 ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*Step 4: Set the Back/Front Angle trip points in register 0x13 following the table in the data sheet.
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x13);
	   PL_BF_ZCOMP_Data& = 0x3F; //Clear bit 7 and 6
	   Select one of the following to set the B/F angle value:
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional and keeps bits [7:6] = 00
	   PL_BF_ZCOMP_Data | = 0x40; //Sets bits[7:6] = 01
	   PL_BF_ZCOMP_Data | = 0x80; //Sets bits[7:6] = 02
	   PL_BF_ZCOMP_Data | = 0xC0; //Sets bits[7:6] = 03
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Back/Front Angle

	   Step 5: Set the Z-Lockout angle trip point in register 0x13 following the table in the data sheet.
	   //NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   PL_BF_ZCOMP_Data = IIC_RegRead(0x1C); //Read out contents of the register (can be read by all
	   versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   PL_BF_ZCOMP_Data& = 0xF8; //Clear the last three bits of the register
	   Select one of the following to set the Z-lockout value
	   PL_BF_ZCOMP_Data | = 0x00; //This does nothing additional but the Z-lockout selection will remain at
	   14°
	   PL_BF_ZCOMP_Data | = 0x01; //Set the Z-lockout angle to 18°
	   PL_BF_ZCOMP_Data | = 0x02; //Set the Z-lockout angle to 21°
	   PL_BF_ZCOMP_Data | = 0x03; //Set the Z-lockout angle to 25°
	   PL_BF_ZCOMP_Data | = 0x04; //Set the Z-lockout angle to 29°
	   PL_BF_ZCOMP_Data | = 0x05; //Set the Z-lockout angle to 33°
	   PL_BF_ZCOMP_Data | = 0x06; //Set the Z-lockout angle to 37°
	   PL_BF_ZCOMP_Data | = 0x07; //Set the Z-lockout angle to 42°
	   IIC_RegWrite(0x13, PL_BF_ZCOMP_Data); //Write in the updated Z-lockout angle
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_BF_ZCOMP_REG, PL_BF_ZCOMP_REG_value ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 6: Set the Trip Threshold Angle
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   Select the angle desired in the table, and, Enter in the values given in the table for the corresponding angle.
	   Refer to Figure 7 for the reference frame of the trip angles.
	   P_L_THS_Data = IIC_RegRead(0x14); (can be read by all versions of MMA845xQ)
	   The remaining parts of this step only apply to MMA8451Q
	   P_L_THS_Data& = 0x07; //Clear the Threshold values
	   Choose one of the following options
	   P_L_THS_Data | = (0x07)<<3; //Set Threshold to 15°
	   P_L_THS_Data | = (0x09)<<3; //Set Threshold to 20°
	   P_L_THS_Data | = (0x0C)<<3; //Set Threshold to 30°
	   P_L_THS_Data | = (0x0D)<<3; //Set Threshold to 35°
	   P_L_THS_Data | = (0x0F)<<3; //Set Threshold to 40°
	   P_L_THS_Data | = (0x10)<<3; //Set Threshold to 45°
	   P_L_THS_Data | = (0x13)<<3; //Set Threshold to 55°
	   P_L_THS_Data | = (0x14)<<3; //Set Threshold to 60°
	   P_L_THS_Data | = (0x17)<<3; //Set Threshold to 70°
	   P_L_THS_Data | = (0x19)<<3; //Set Threshold to 75°
	   IIC_RegWrite(0x14, P_L_THS_Data);

	   Step 7: Set the Hysteresis Angle
	   NOTE: This register is readable in all versions of MMA845xQ but it is only modifiable in the MMA8451Q.
	   Select the hysteresis value based on the desired final trip points (threshold + hysteresis)
	   Enter in the values given in the table for that corresponding angle.
	   Note: Care must be taken. Review the final resulting angles. Make sure there isn’t a resulting trip value
	   greater than 90 or less than 0.
	   The following are the options for setting the hysteresis.
	   P_L_THS_Data = IIC_RegRead(0x14);
	   NOTE: The remaining parts of this step only apply to the MMA8451Q.
	   P_L_THS_Data& = 0xF8; //Clear the Hysteresis values
	   P_L_THS_Data | = 0x01; //Set Hysteresis to ±4°
	   P_L_THS_Data | = 0x02; //Set Threshold to ±7°
	   P_L_THS_Data | = 0x03; //Set Threshold to ±11°
	   P_L_THS_Data | = 0x04; //Set Threshold to ±14°
	   P_L_THS_Data | = 0x05; //Set Threshold to ±17°
	   P_L_THS_Data | = 0x06; //Set Threshold to ±21°
	   P_L_THS_Data | = 0x07; //Set Threshold to ±24°
	   IIC_RegWrite(0x14, P_L_THS_Data);
	 */

	if( IIC_RegWrite( MMA845X_ADDR, PL_P_L_THS_REG, PL_P_L_THS_REG_vlaue ) )
	{
		goto lbl_mma8451_config_err;
	}


