GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
	/*
	   Step 8: Register 0x2D, Control Register 4 configures all embedded features for interrupt
	   detection.
	   To set this device up to run an interrupt service routine:
	   Program the Orientation Detection bit in Control Register 4.
	   Set bit 4 to enable the orientation detection “INT_EN_LNDPRT”.
	   CTRL_REG4_Data = IIC_RegRead(0x2D); //Read out the contents of the register
	   CTRL_REG4_Data | = 0x10; //Set bit 4
	   IIC_RegWrite(0x2D, CTRL_REG4_Data); //Set the bit and write into CTRL_REG4
	 */

	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG4, 0x10 ) )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 9: Register 0x2E is Control Register 5 which gives the option of routing the interrupt to
	   either INT1 or INT2
	   Depending on which interrupt pin is enabled and configured to the processor:
	   Set bit 4 “INT_CFG_LNDPRT” to configure INT1, or,
	   Leave the bit clear to configure INT2.
	   CTRL_REG5_Data = IIC_RegRead(0x2E);
	   In the next two lines choose to clear bit 4 to route to INT2 or set bit 4 to route to INT1
	   CTRL_REG5_Data& = 0xEF; //Clear bit 4 to choose the interrupt to route to INT2
	   CTRL_REG5_Data | = 0x10; //Set bit 4 to choose the interrupt to route to INT1
	   IIC_RegWrite(0x2E, CTRL_REG5_Data); //Write in the interrupt routing selection
	 */
	//value=IIC_RegRead(MMA845X_ADDR,CTRL_REG5);
	////value&=0xEF;
	//value |= 0x10;  // INT1
	//IIC_RegWrite(MMA845X_ADDR,CTRL_REG5,value);


	/*
	   Step 10: Set the debounce counter in register 0x12
	   This value will scale depending on the application-specific required ODR.
	   If the device is set to go to sleep, reset the debounce counter before the device goes to sleep. This setting
	   helps avoid long delays since the debounce will always scale with the current sample rate. The debounce
	   can be set between 50 ms - 100 ms to avoid long delays.
	   IIC_RegWrite(0x12, 0x05); //This sets the debounce counter to 100 ms at 50 Hz
	 */

	res = IIC_RegWrite( MMA845X_ADDR, PL_COUNT_REG, 0x02 );
	if( res )
	{
		goto lbl_mma8451_config_err;
	}


	/*
	   Step 11: Put the device in Active Mode
	   CTRL_REG1_Data = IIC_RegRead(0x2A); //Read out the contents of the register
	   CTRL_REG1_Data | = 0x01; //Change the value in the register to Active Mode.
	   IIC_RegWrite(0x2A, CTRL_REG1_Data); //Write in the updated value to put the device in Active Mode
	 */

//	value=IIC_RegRead(MMA845X_ADDR,CTRL_REG1);
//	value |= 0x01;
//	IIC_RegWrite(MMA845X_ADDR,CTRL_REG1,value);
//active

/*TAP设置*/
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_CFG_REG, 0x55 ) )
	{
		goto lbl_mma8451_config_err;
	}

	//加速度门限 0.1g 1-79	扩展为0.0625  1-127  扩大1.6倍

	res = ( ( param_mma8451_word2 & 0xff00 ) >> 8 ) * 1.6;

	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSX_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSY_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_THSZ_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}

	res = param_mma8451_word2 & 0xff;
	if( IIC_RegWrite( MMA845X_ADDR, PULSE_TMLT_REG, res ) )
	{
		goto lbl_mma8451_config_err;
	}

	if( IIC_RegWrite( MMA845X_ADDR, CTRL_REG1, ( CTRL_REG1_value | ACTIVE_MASK ) ) )
	{
		goto lbl_mma8451_config_err;
	}

	return ERR_NONE;

lbl_mma8451_config_err:
	printf( "\r\n%d>(%s) err=%d\r\n", SysTicks, __func__, res );
	return res;
}


/*
   碰撞时间门限
   碰撞加速度门限

   指定时间门限内，加速度持续大于门限即为碰撞
 */

static uint8_t	sensor_info[2]	= { 0 };


/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
void mma8451_proc( void )
{
	uint8_t		int_source, pl;
	uint16_t	res;

/*IIC出错,重新连接*/
	if( mma8451_need_config )
	{
		res = mma8451_config( param_mma8451_word1, param_mma8451_word2 );
		if( res == 0 )
		{
			mma8451_need_config = 0;
		}
		return;
	}

	if( ( param_mma8451_word1 & 0x8000 ) == 0x0 )
	{
		return;
	}
/*倾斜*/
	res = IIC_RegRead( MMA845X_ADDR, INT_SOURCE_REG, &int_source );
	if( res )
	{
		mma8451_need_config = 1;
		return;
	}

	if( ( int_source & 0x10 ) == 0x10 )
	{
		res = IIC_RegRead( MMA845X_ADDR, PL_STATUS_REG, &pl );
		if( res )
		{
			mma8451_need_config = 1;
			return;
		}

		if( ( sensor_info[0] & 0x40 ) == 0x40 ) //首次使用,不发送
		{
			if( ( SysTicks - lastsend_rotation_ticks ) > 1000 )
			{
				printf( "\r\n%d>pl=%02x", SysTicks, pl );
				if( pl != last_plstatus )
				{
					uart2_send_frame( '2', 2, sensor_info, 1 );
					last_plstatus = pl;
				}
				lastsend_rotation_ticks = SysTicks;
			}
		}else
		{
			printf( "\r\n%d>First pl=%02x", SysTicks, pl );
		}
		sensor_info[0] |= 0x40;
	}
/*碰撞 TAP*/

	res = IIC_RegRead( MMA845X_ADDR, PULSE_SRC_REG, &int_source );
	if( res )
	{
		mma8451_need_config = 1;
		return;
	}

	if( int_source >= 0x80 )
	{
		if( ( SysTicks - lastsend_crash_ticks ) > 1000 )
		{
			sensor_info[0] |= 0x80;
			uart2_send_frame( '2',2, sensor_info, 1 );
			lastsend_crash_ticks = SysTicks;
		}
		printf( "\r\n%d>PULSE_SRC_REG=%02x", SysTicks, int_source );
	}
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
int mma8451_rx( unsigned char *pdata, unsigned int len )
{
	if( pdata[0] == 1 )
	{
		param_mma8451_word1 = ( pdata[1] << 8 ) | pdata[2];
		param_mma8451_word2 = ( pdata[3] << 8 ) | pdata[4];
		EE_WriteVariable( VirtAddVarTab[12], param_mma8451_word1 );
		EE_WriteVariable( VirtAddVarTab[13], param_mma8451_word2 );
		mma8451_config( param_mma8451_word1, param_mma8451_word2 );
	}
	return 0;
}


