GuoZhiyong/RTT_GPS_STUSB/bsp/stm32f40x_car/drivers/mma8451.c
static rt_err_t mma8451_init( rt_device_t dev )
{
		GPIO_InitTypeDef	GPIO_InitStructure;
		uint16_t			res;
		uint16_t			param1	= 0x8000, param2 = 0x1e02;
		uint16_t			i		= 0;
	
		RCC_APB2PeriphClockCmd( RCC_APB2Periph_AFIO | RCC_APB2Periph_GPIOA | RCC_APB2Periph_GPIOB, ENABLE );
		/*去掉JTAG功能*/
		GPIO_PinRemapConfig( GPIO_Remap_SWJ_JTAGDisable, ENABLE );
		GPIO_PinRemapConfig( GPIO_Remap_SWJ_Disable, ENABLE );
	
		GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	//	GPIO_InitStructure.GPIO_Mode	= GPIO_Mode_AF_OD;
		GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_OD;
	
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
		GPIO_Init( GPIOB, &GPIO_InitStructure );
	
		GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4;
		GPIO_Init( GPIOB, &GPIO_InitStructure );
	
		res = EE_ReadVariable( VirtAddVarTab[12], &i );
		if( res )
		{
			EE_WriteVariable( VirtAddVarTab[12], param1 ); //还没有初始化,写入缺省值
		}else
		{
			param1 = i;
		}
	
		res = EE_ReadVariable( VirtAddVarTab[13], &i );
		if( res )
		{
			EE_WriteVariable( VirtAddVarTab[13], param2 );
		} else
		{
			param2 = i;
		}
	
		res = EE_ReadVariable( VirtAddVarTab[14], &i );
		if( res )
		{
			EE_WriteVariable( VirtAddVarTab[14], CTRL_REG1_value );
		} else
		{
			CTRL_REG1_value = i;
		}
	
		res = EE_ReadVariable( VirtAddVarTab[15], &i );
		if( res )
		{
			EE_WriteVariable( VirtAddVarTab[15], PL_BF_ZCOMP_REG_value );
		} else
		{
			PL_BF_ZCOMP_REG_value = i;
		}
	
		res = EE_ReadVariable( VirtAddVarTab[16], &i );
		if( res )
		{
			EE_WriteVariable( VirtAddVarTab[16], PL_P_L_THS_REG_vlaue );
		} else
		{
			PL_P_L_THS_REG_vlaue = i;
		}
	
		printf( "\r\n%d>(%s) param1=%04x param2=%04x\r\n", SysTicks, __func__, param1, param2 );
		res = mma8451_config( param1, param2 );
		if( res == 0 )
		{
			mma8451_need_config = 0;
		}


	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_open( rt_device_t dev, rt_uint16_t oflag )
{
	//初始化端口
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_read( rt_device_t dev, rt_off_t pos, void* buff, rt_size_t count )
{
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_size_t mma8451_write( rt_device_t dev, rt_off_t pos, const void* buff, rt_size_t count )
{
	rt_size_t ret=RT_EOK;
	ret=ringbuffer_put_data(&rb_printer_data,count,(unsigned char *)buff);
	return ret;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_control( rt_device_t dev, rt_uint8_t cmd, void *arg )
{
	uint8_t code = *(uint8_t*)arg;
	int		i;
	switch( cmd )
	{

	}
	return RT_EOK;
}

/***********************************************************
* Function:       // 函数名称
* Description:    // 函数功能、性能等的描述
* Input:          // 1.输入参数1，说明，包括每个参数的作用、取值说明及参数间关系
* Input:          // 2.输入参数2，说明，包括每个参数的作用、取值说明及参数间关系
* Output:         // 1.输出参数1，说明
* Return:         // 函数返回值的说明
* Others:         // 其它说明
***********************************************************/
static rt_err_t mma8451_close( rt_device_t dev )
{
	return RT_EOK;
}



/*
如何与其他程序交互，使用设备的rx_ind
还是定时查询

*/
void mma8451_driver_init( void )
{
	dev_mma8451.type		= RT_Device_Class_Char;
	dev_mma8451.init		= mma8451_init;
	dev_mma8451.open		= mma8451_open;
	dev_mma8451.close		= mma8451_close;
	dev_mma8451.read		= mma8451_read;
	dev_mma8451.write		= mma8451_write;
	dev_mma8451.control		= mma8451_control;
	dev_mma8451.user_data	= RT_NULL;

	rt_device_register( &dev_mma8451, "sensor", RT_DEVICE_FLAG_RDWR );
	rt_device_init( &dev_mma8451 );
}





/************************************** The End Of File **************************************/
